ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
#define ODOM_PUBLISH_PERIOD_MS 100   /* 10 Hz */

static const char *TAG = "control_task";

/* Shared between ISR (writer) and control_task (reader) -> must be volatile
 * so the compiler never caches a stale copy in a register. */
static volatile uint32_t pulse_count_left = 0;
static volatile uint32_t pulse_count_right = 0;

/* Latest computed RPM, exposed for uros_task (F5) to read later. */
static volatile float rpm_left_shared = 0.0f;
static volatile float rpm_right_shared = 0.0f;

/* F5: /cmd_vel, written by uros_task's subscription callback, read by
 * control_task. last_cmd_vel_us is the watchdog clock - see
 * CMD_VEL_TIMEOUT_US comment above. */
static volatile float cmd_linear_x = 0.0f;
static volatile float cmd_angular_z = 0.0f;
static volatile int64_t last_cmd_vel_us = 0;

/* F5: pose + velocity, written by control_task (F4 odometry math), read by
 * uros_task to publish /odom. Plain floats (not the mutex-protected pulse
 * counters) - a torn read here would be a stale/slightly-off reading, not a
 * silently-corrupted control decision, so it's not worth the locking. */
static volatile float pose_x_shared = 0.0f;
static volatile float pose_y_shared = 0.0f;
static volatile float pose_theta_shared = 0.0f;
static volatile float linear_vel_shared = 0.0f;
static volatile float angular_vel_shared = 0.0f;

/* Added for hardware debugging (Alex, one-wheel-not-spinning investigation):
 * applied_pwm_left/right were previously local-only to control_task, so
 * uros_task had no way to report them. Mirrors the rpm_*_shared pattern
 * above. */
static volatile float pwm_left_shared = 0.0f;
static volatile float pwm_right_shared = 0.0f;

/* Gyro-Z heading fusion (2026-08-22), written by uros_task's existing IMU
 * read, read by control_task - same cross-task pattern as rpm_*_shared
 * above. imu_gz_valid_shared is false whenever the most recent read failed
 * (IMU never woke, or the ~20s-uptime read-degradation bug latched imu_dev
 * dead for this boot - see README "Lessons Learned") so control_task can
 * always fail safe back to the original encoder-differential dtheta
 * instead of blending in a stale/garbage gyro value. */
static volatile float imu_gz_rad_per_s_shared = 0.0f;
static volatile bool imu_gz_valid_shared = false;

/* Magnetometer heading fusion (2026-08-28), same cross-task pattern as
 * imu_gz_rad_per_s_shared above - written by uros_task's mag read, read by
 * control_task. mag_heading_valid_shared false means "don't use this",
 * same fail-safe philosophy as imu_gz_valid_shared. Value is already
 * zero-referenced against wherever the robot was pointed at boot (see
 * g_mag_calibrated in uros_task) - NOT a true compass bearing, doesn't need
 * to be one, since this whole system's heading frame is relative/arbitrary
 * (odom frame) to begin with. */
static volatile float mag_heading_rad_shared = 0.0f;
static volatile bool mag_heading_valid_shared = false;

/* Boot-time zero-reference "calibration" (see uros_task's mag_read_raw call
 * site) - only ever touched from within uros_task itself, no cross-task
 * sharing needed, unlike the two above. Declared here (before uros_task,
 * which is the first user of them) for the same declaration-order reason as
 * CONTROL_PERIOD_MS/GYRO_RAW_TO_RAD_PER_S above - this file has been bitten
 * by using-before-declaring before, this is that same bug caught at
 * compile time this round instead of shipping it. */
static float g_mag_heading_offset_rad = 0.0f;
static bool g_mag_calibrated = false;

/* How strongly each 200ms control cycle nudges pose_theta_shared toward the
 * compass heading. Deliberately small: the gyro should still dominate
 * moment-to-moment (smooth, fast, low-noise), the compass only slowly
 * drags the estimate back when the gyro has drifted - a standard
 * complementary filter. Starting guess, same "start small" philosophy as
 * Kp/Ki above - watch whether long-run drift is actually reduced before
 * tuning this further. */
#define MAG_FUSION_WEIGHT 0.02f

/* MPU6050 power-on-reset default full-scale range: gyro +/-250deg/s at
 * 131 LSB/(deg/s) (same constant jetson/tools/process_imu_raw.py uses
 * off-device). /imu_raw itself stays raw ints by design - this conversion
 * is only for control_task's internal heading math, which needs radians
 * to add directly to pose_theta_shared. Defined here (before uros_task,
 * which is the first user of it) - not down near imu_read_raw() where it
 * conceptually "belongs", to avoid the exact declaration-order bug this
 * file has been bitten by before (CONTROL_PERIOD_MS, 2026-07-27). */
#define GYRO_RAW_TO_RAD_PER_S (PI_F / (180.0f * 131.0f))

/* Spinlock used to make "read + reset" atomic (avoids the lost-pulse race
 * where a pulse arrives between reading the counter and zeroing it). */
static portMUX_TYPE encoder_mux = portMUX_INITIALIZER_UNLOCKED;

/* Debounce: while the motor is actually running (not hand-spun), PWM
 * switching edges and DC-brush arcing couple electrical noise onto the
 * encoder signal line, which the ISR was counting as real slot transitions
 * (confirmed 2026-07-27: hand-spinning gave clean 0-60 RPM, motor-running
 * gave RPM spiking as high as 6300). Reject edges that arrive faster than
 * any real slot transition physically could - at TARGET_RPM=30 the real
 * interval is ~100ms, so there's large margin to push this threshold up.
 * 3ms wasn't enough (tested 2026-07-27: cut peak noise from RPM=6300 down
 * to RPM=540, but R still noisy vs. L's clean 0/60) - PWM runs at 1kHz
 * (1ms period), so switching noise can recur faster than a 3ms window
 * rejects. Raised to 15ms, still >>3x below the real ~50ms interval. */
#define MIN_PULSE_INTERVAL_US 15000

static volatile int64_t last_edge_us_left = 0;
static volatile int64_t last_edge_us_right = 0;

/* 2026-07-27, after fixing a bad encoder solder joint: with clean pulses,
 * RPM was still visibly jumping in fixed steps (0, 15, 30, 45...) with no
 * in-between values. Root cause: counting whole pulses in a fixed 200ms
 * window can only ever measure in units of "1 pulse / window" = 15 RPM -
 * a motor spinning at, say, 22 RPM is invisible to that method. Fixed by
 * also recording the time BETWEEN consecutive pulses (`last_interval_us`),
 * so control_task can compute RPM from timing instead of counting - the
 * standard "period measurement" tachometer technique, far finer resolution
 * at low speed than "frequency measurement" (pulse-counting) gives. */
static volatile int64_t last_interval_us_left = 0;
static volatile int64_t last_interval_us_right = 0;

