ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* Guards uros_task's control loop from a flaky/loose IMU wire: bounds each
 * stall tightly (a healthy MPU6050 answers in well under 1ms at 400kHz -
 * 5ms is already generous) AND gives up retrying after repeated failures
 * instead of eating that stall every single 100ms cycle forever. Matches
 * the same "don't let IMU trouble touch the proven motor/odom path"
 * philosophy as setup_imu()'s soft-fail. */
static bool imu_read_raw(int16_t *ax, int16_t *ay, int16_t *az,
                          int16_t *gx, int16_t *gy, int16_t *gz) {
    static uint8_t consecutive_failures = 0;

    if (imu_dev == NULL) {
        return false;
    }
    uint8_t reg = MPU6050_REG_ACCEL_XOUT_H;
    uint8_t data[IMU_READ_LEN];
    /* 2026-08-20: was 5ms. The wake-up write (a simpler transaction, no
     * repeated-start) succeeds on attempt 1 every time, but this combined
     * write+repeated-start+14-byte-read was failing 100% of the time at
     * 5ms - testing whether that's simply too tight for the more complex
     * transaction on this wiring, not a fully broken connection. */
    if (i2c_master_transmit_receive(imu_dev, &reg, 1, data, sizeof(data),
                                     pdMS_TO_TICKS(100)) != ESP_OK) {
        if (++consecutive_failures >= IMU_MAX_CONSECUTIVE_FAILURES) {
            imu_dev = NULL;  /* bus likely wedged - stop paying the stall */
        }
        return false;
    }
    consecutive_failures = 0;
    *ax = (int16_t)((data[0]  << 8) | data[1]);
    *ay = (int16_t)((data[2]  << 8) | data[3]);
    *az = (int16_t)((data[4]  << 8) | data[5]);
    /* data[6]/data[7] = temperature, unused here */
    *gx = (int16_t)((data[8]  << 8) | data[9]);
    *gy = (int16_t)((data[10] << 8) | data[11]);
    *gz = (int16_t)((data[12] << 8) | data[13]);
    return true;
}

/* Burst-reads 6 bytes starting at the X MSB register. HMC5883L's register
 * order is X, Z, Y - not X,Y,Z, confirmed against the datasheet - so the
 * parsing below deliberately doesn't follow the byte order line by line.
 * Same fail-soft/give-up-after-N-failures pattern as imu_read_raw() above. */
#define MAG_MAX_CONSECUTIVE_FAILURES 5

static bool mag_read_raw(int16_t *mx, int16_t *my, int16_t *mz) {
    static uint8_t consecutive_failures = 0;

    if (mag_dev == NULL) {
        return false;
    }
    uint8_t reg = HMC5883L_REG_DATA_X_MSB;
    uint8_t data[HMC5883L_READ_LEN];
    if (i2c_master_transmit_receive(mag_dev, &reg, 1, data, sizeof(data),
                                     pdMS_TO_TICKS(100)) != ESP_OK) {
        if (++consecutive_failures >= MAG_MAX_CONSECUTIVE_FAILURES) {
            mag_dev = NULL;  /* bus likely wedged - stop paying the stall */
        }
        return false;
    }
    consecutive_failures = 0;
    *mx = (int16_t)((data[0] << 8) | data[1]);
    *mz = (int16_t)((data[2] << 8) | data[3]);
    *my = (int16_t)((data[4] << 8) | data[5]);
    return true;
}

/* UART0 is the same physical wire idf.py monitor uses for the console - see
 * the F5 note on ESP_LOGI above. Reused from the proven esp32/microros_hello
 * pin/transport setup (Week 1), not a new choice. */
static size_t uart_port = UART_NUM_0;

void app_main(void) {
    /* First thing, before anything else touches power/peripherals - see
     * g_reset_reason comment above for why this matters. */
    g_reset_reason = esp_reset_reason();

    setup_gpio();
    setup_pwm();
    setup_imu();

    /* Sets the electrical default (forward) before control_task starts
     * updating these live every cycle from the actual commanded direction
     * (see the signed_target_left/right block in control_task, fixed
     * 2026-08-26). PWM=0 from a stale/absent /cmd_vel (the safety default)
     * means the motors don't move regardless of what these say.
     *
     * FLIPPED 2026-08-11 (was AIN1=1,AIN2=0 / BIN1=1,BIN2=0): the front/back
     * half of the forward-direction redefinition — see the AIN1_PIN #define
     * comment above for the full reasoning. This reverses each wheel's
     * physical spin direction for the same PWM value, which combined with
     * the pin-routing swap above is what makes the robot's "forward" match
     * the camera's facing direction instead of the original mount
     * direction. */
    gpio_set_level(STBY_PIN, 1);   /* wake the TB6612FNG out of standby */
    gpio_set_level(AIN1_PIN, 0);
    gpio_set_level(AIN2_PIN, 1);
    gpio_set_level(BIN1_PIN, 0);
    gpio_set_level(BIN2_PIN, 1);

    rmw_uros_set_custom_transport(true, (void *)&uart_port,
        esp32_serial_open, esp32_serial_close,
        esp32_serial_write, esp32_serial_read);

    /* BUG FOUND 2026-07-27 (F5 first test): ESP_LOGI/ESP_LOGW in control_task
     * and the micro-ROS transport above both write to UART0 at the same
     * time - confirmed live as a burst of garbled characters in the monitor
     * output, at the same moment the micro-ROS agent never saw a valid
     * session-establish packet. The two streams were corrupting each other.
     * Once the transport is set, all console log output must stop - from
     * here on, debugging is via `ros2 topic echo` on the Jetson, not
     * idf.py monitor (see README F5 section). */
    esp_log_level_set("*", ESP_LOG_NONE);

    xTaskCreate(control_task, "control_task", 4096, NULL, 5, NULL);
    xTaskCreate(uros_task, "uros_task", 16000, NULL, 5, NULL);

    /* app_main returns here; both tasks keep running. */
}
